//
// Created by LinSihan on 2019/11/3.
//
/*********************************************************
 * 题目描述
        输入一串字符,将其中的大写变成小写，若不为大写则原样输出
 *输入描述
        任意字符串(长度在100以内)以回车表示输入结束
 *输出描述
        将其中的大写 输出相应的小写，若不为大写则原样输出
*******************************************************/
#include <stdio.h>

int main(){
    char list[100];
    int i;
    for(i = 0; scanf("%c", &list[i]), list[i] != '\n'; i++  );
    list[i] = '\0';

    for(i = 0; list[i] != '\0'; i++){
        (list[i] >= 'A' && list[i] <= 'Z') ? list[i] = list[i]+32 : list[i];
    }

    printf("%s", list);
    return 0;
}