//
// Created by LinSihan on 2019/11/1.
//
/*************************************************************************************
    题目：
        有一分数序列：2/1 3/2 5/3 8/5 13/8 21/13......求出这个数列的前N项之和，保留两位小数。
    输入描述：
        输入共有T (1 <= T <= 2000) 组.
        输入的第一行为一个数字T, 表示数据的组数.
        输入的第2~T+1行每行一个整数N (1 <= N <= 100000)， 表示要求的数列的长度.
    输出描述：
        对于每组数据, 输出数列前N项和.
 **************************************************************************************/

/*
 * 思路：
 *      数列：a = 2, b =1
 *            a/b (a+b)/a
 *      T = 外循环次数
 *      N = 内循环求和次数
 */

#include <stdio.h>

int main(){
    int T, N;
    double a = 2.0, b = 1.0, sum = 0;

    scanf("%d", &T);
    while(T--){
        sum = 0;
        a = 2.0;
        b = 1.0;
        while(scanf("%d", &N), N--){
            sum += a / b;
            a = a + b;
            b = a - b;
        }
        printf(".2lf", sum);
    }
    return 0;
}













