//
// Created by LinSihan on 2019/12/7.
//
/*********************************************************
    题目描述
    Description
    有n人围成一圈，顺序排号。从第1个人开始报数（从1到3报数），
    凡报到3的人退出圈子，问最后留下的是原来的第几号的那位。
    输入描述
    Input
    初始人数n
    输出描述
    Output
    最后一人的初始编号
*********************************************************/

#include <stdio.h>

int main(){
    int i, n, count = 0;
    scanf("%d", &n);
    for(i = 1; i <= n; i++){
        if(i % 3 == 0){
            count ++;
        }
    }
    printf("%d\n", n - count);
    return 0;
}